{
  "title": "PlayGames.Onl",
  "props": {
    "threedo_bios": "https://playgames.onl/games/3do/bios/panafz1.bin",
    "threedo_fonts": "https://playgames.onl/games/3do/bios/panafz1j-kanji.bin"
  },
  "categories": [
    {
      "title": "3DO Games",
      "items": [
        {
          "props": {
            "uid": "deddb5c2-19e9-4da6-8fc1-9c5adb7b9e25",
            "discs": [
              "https://archive.org/download/chd_3do/CHD-3DO/Return%20Fire%20-%20Maps%20O%27%20Death%20%28USA%29.chd"
            ]
          },
          "type": "3do",
          "title": "Return Fire",
          "description": "Return Fire is the spiritual successor to Fire Power and it fits in both the strategy and action genres. You can take control of one of 4 vehicles, a jeep, helicopter, tank and a missile launching vehicle (but actually called The Armoured Support Vehicle (ASV).There are are two ways to win, the easier one would be to capture the enemy's flag by bringing it to your bunker with the frail Jeep. This is the main objective. The other way to win is to destroy your enemy, a secondary objective.",
          "thumbnail": "https://raw.githubusercontent.com/webrcade-assets/webrcade-assets-3do-images/master/Named_Titles/resized/Return%20Fire%20(Japan%2C%20Europe)%20(En%2CJa%2CFr%2CDe%2CEs%2CIt%2CPt%2CKo%2CRu%2CAr).png",
          "background": "https://raw.githubusercontent.com/webrcade-assets/webrcade-assets-3do-images/master/Named_Snaps/output/Return%20Fire%20(Japan%2C%20Europe)%20(En%2CJa%2CFr%2CDe%2CEs%2CIt%2CPt%2CKo%2CRu%2CAr).png",
          "backgroundPixelated": true,
          "added": 1757271297808
        },
        {
          "props": {
            "uid": "b3135166-e2e5-47aa-b7ef-3a279fb68f21",
            "discs": [
              "https://dn720006.ca.archive.org/0/items/chd_3do/CHD-3DO/Road%20Rash%20%28USA%29.chd"
            ]
          },
          "type": "3do",
          "title": "Road Rash",
          "description": "This is a remake of the original Road Rash from the early nineties. For those who have not played the original, you are competing against thirteen other \"Road Rashers\" who will stop at nothing to win 1st, 2nd, or 3rd place. During the race, you have two options available to you: you can either do your best to cross the finish line, or use your weapon to bring the Rashers to the ground if they are giving you trouble. If you do the latter, your opponents will do the same to you during the next race that takes place. There are five circuits to race: The City, The Peninsula, Pacific Highway, Sierra Nevada, and Napa Valley. Some of these circuits are dangerous. As well as the obstacles and traffic that you encounter along the way, there are also cops driving on bikes who will arrest you if you happen to crash or stop your bike near them, and you have to pay a fine in order to get in any more races. Your bike will be wrecked if you crash too many times, and you have to pay for damages, but the amount you have to pay depends on the bike that you are riding. Once you have completed the first five circuits, you have to race them again another four times - but at a much more difficult level. Manage to win all five circuits on all levels, and you win the Road Rash cup.There are about five bikes to choose from, which are divided into three groups. Rat, Sport, and Super. You start the first level with a Rat bike, but as you proceed through the levels, it is important to pick bikes from a different bike class.If you have no plans to win the Road Rash cup, you can choose the game's Thrash mode. The difference between this and the other mode is that there is no money involved (ie: you are not allowed to buy bikes), and you are competing against fourteen opponents. And if you wreck your bike or you get busted, you have to start all over again. Regardless of the mode you pick, you will always start in the last place.The remake also contains FMV movies that usually depict the outcome of the races, as well as limited songs performed by various recording artists, including Soundgarden, Therapy?, Monster Magnet, and Swervedriver. These songs can be changed on-the-fly via the game's options menu.",
          "thumbnail": "https://raw.githubusercontent.com/webrcade-assets/webrcade-assets-3do-images/master/Named_Titles/resized/Road%20Rash%20(Europe).png",
          "background": "https://raw.githubusercontent.com/webrcade-assets/webrcade-assets-3do-images/master/Named_Snaps/output/Road%20Rash%20(Europe).png",
          "backgroundPixelated": true,
          "added": 1757271080894
        },
        {
          "props": {
            "uid": "ee7ec66f-da63-41ed-9383-d8f3aad63f26",
            "discs": [
              "https://archive.org/download/chd_3do/CHD-3DO/SnowJob%20Starring%20Tracy%20Scoggins%20%28USA%29%20%28Disc%201%29.chd",
              "https://archive.org/download/chd_3do/CHD-3DO/SnowJob%20Starring%20Tracy%20Scoggins%20%28USA%29%20%28Disc%202%29.chd"
            ]
          },
          "type": "3do",
          "title": "SnowJob",
          "description": "Murder. Drugs. Sex. Gangs. Guns. Welcome to the Big Apple. Your name is Jock LaMonte, a retired New York Cop. You are living peacefully in New Mexico when you find out your ex girlfriend, Lara Calabreze, assistant DA of the city, is on the hit list on a notorious mob boss who goes only by the name Snow Man. It is up to you to use your wits, guts, and charm to save Lara and put away the evil of New York City.Snow Job is a point-and-click adventure and is played in the first-person, with the ability to see 360 degrees in a photorealistic world with FMV video. You must solve puzzles, converse with many characters, and fight your way through mini games. Gameplay consists of three screens, one to explore the environment in different directions from a fixed position, an inventory and also a map where new locations appear.",
          "thumbnail": "https://images.launchbox-app.com/1600201f-1537-4f08-b130-8491bd834d18.png",
          "background": "https://images.launchbox-app.com/ab5cac37-aae5-41bd-8c0e-664686834799.png",
          "longTitle": "Snow Job: Starring Tracy Scoggins",
          "added": 1757271246525
        },
        {
          "props": {
            "uid": "46f673e4-df13-4f41-ab8c-6a0fc4d7e879",
            "discs": [
              "https://archive.org/download/chd_3do/CHD-3DO/Road%20%26%20Track%20Presents%20-%20The%20Need%20for%20Speed%20%28USA%2C%20Europe%29.chd"
            ]
          },
          "type": "3do",
          "title": "The Need for Speed",
          "description": "Road & Track Presents: The Need for Speed is a racing video game developed by EA Canada, originally known as Pioneer Productions, and published by Electronic Arts, released for the 3DO in 1994, and ported to MS-DOS in 1995.",
          "thumbnail": "https://raw.githubusercontent.com/webrcade-assets/webrcade-assets-3do-images/master/Named_Titles/resized/Road%20%26%20Track%20Presents%20-%20The%20Need%20for%20Speed%20(USA%2C%20Europe).png",
          "background": "https://raw.githubusercontent.com/webrcade-assets/webrcade-assets-3do-images/master/Named_Snaps/output/Road%20%26%20Track%20Presents%20-%20The%20Need%20for%20Speed%20(USA%2C%20Europe).png",
          "backgroundPixelated": true,
          "longTitle": "Road & Track Presents - The Need for Speed",
          "added": 1757271141322
        }
      ],
      "longTitle": "3DO Interactive Multiplayer",
      "description": "The 3DO Interactive Multiplayer (often called simply 3DO) is a video game console originally produced by Panasonic in 1993. Further renditions of the hardware were released in 1994 by Sanyo and Goldstar. The consoles were manufactured according to specifications created by The 3DO Company, and were originally designed by Dave Needle and RJ Mical of New Technology Group. The system was conceived by entrepreneur and Electronic Arts founder Trip Hawkins.",
      "thumbnail": "https://playgames.onl/images/3do-thumb.png",
      "background": "https://playgames.onl/images/3do-background.png"
    }
  ],
  "longTitle": "PlayGames.Onl 🕹️ Play Retro Games Online",
  "description": "Thousands of games for PlayStation, SEGA, Nintendo, Atari, Arcade, 3DO, NEC. Multi-system emulator to play retro games online in your browser."
}